tap "burntsushi/ripgrep", "https://github.com/BurntSushi/ripgrep.git"
tap "d12frosted/emacs-plus"
tap "dopplerhq/cli"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "superfly/tap"
tap "johanhaleby/kubetail"
tap "derailed/k9s"
tap "gromgit/fuse"

brew "act"
brew "sqlite"
brew "python@3.10"
brew "ansible"
brew "apktool"
brew "glib"
brew "autoconf"
brew "awscli"
brew "bash-completion"
brew "bison"
brew "boost"
brew "cmake"
brew "coreutils"
brew "csshx"
brew "little-cms2"
brew "qt"
brew "poppler"
brew "diff-pdf"
brew "gromgit/fuse/encfs-mac"
brew "f3"
brew "gobject-introspection"
brew "harfbuzz"
brew "libarchive"
brew "ffmpeg"
brew "forego"
brew "gdk-pixbuf"
brew "gh"
brew "ghostscript", link: false
brew "git"
brew "gnu-sed"
brew "gnupg", link: false
brew "go"
brew "govendor"
brew "graphicsmagick"
brew "grep"
brew "groovy"
brew "gsettings-desktop-schemas"
brew "pango"
brew "gtk+3"
brew "hevea"
brew "htop"
brew "hugo"
brew "libheif"
brew "imagemagick"
brew "imagemagick@6"
brew "intltool"
brew "oniguruma"
brew "jq"
brew "leiningen"
brew "libgxps", link: true
brew "libphonenumber"
brew "libpq"
brew "librsvg"
brew "libvo-aacenc"
brew "maven"
brew "mitmproxy"
brew "mix-completion"
brew "mkvtoolnix"
brew "mupdf-tools"
brew "nghttp2"
brew "node"
brew "nut"
brew "opendetex"
brew "p7zip"
brew "pandoc"
brew "pdfcrack"
brew "pgcli"
brew "pwgen"
brew "qpdf"
brew "qrencode"
brew "rename"
brew "rlog"
brew "ruby-install"
brew "ssh-copy-id", link: true
brew "subliminal"
brew "syncthing"
brew "svn"
brew "tcpkali"
brew "telnet"
brew "the_silver_searcher"
brew "tree"
brew "unixodbc"
brew "watch"
brew "wget"
brew "youtube-dl"
brew "zsh"
brew "burntsushi/ripgrep/ripgrep-bin"
brew "emacs-plus"
brew "dopplerhq/cli/doppler", link: false
brew "heroku/brew/heroku"
brew "superfly/tap/flyctl"
brew "kubectl"
brew "kubetail"
brew "k9s"

cask "1password-cli"
cask "android-sdk"
cask "docker-edge"
cask "dropbox"
cask "electrum"
cask "filebot"
cask "font-fira-code"
cask "font-fira-mono-for-powerline"
cask "font-hack"
cask "font-ia-writer-duo"
cask "font-ia-writer-duospace"
cask "font-ia-writer-mono"
cask "font-ia-writer-quattro"
cask "inkscape"
cask "itsycal"
cask "jumpcut"
cask "kvirc"
# app for keeping app versions up to date
# brew cask is failing for now
#cask "latest"
cask "ocenaudio"
cask "macfuse"
cask "qsyncthingtray"
cask "session-manager-plugin"
cask "simple-comic"
cask "spectacle"
cask "spotify"
cask "transmission"
cask "vlc"
cask "wkhtmltopdf"
cask "xquartz"
cask "iterm2"
# unrar and rar
cask "rar"
cask "visual-studio-code"
cask "gpg-suite"

# notes from iPad
mas "GoodNotes", id: 1444383602
# more notes
mas "The Journalist", id: 764147223
mas "NextDNS", id: 1464122853
# for unzipping files in finder
mas "The Unarchiver", id: 425424353
mas "Trello", id: 1278508951
mas "PhotoSweeper", id: 463362050
mas "Telegram", id: 747648890
# the better VPN
mas "Tailscale", id: 1475387142
