# =============================================================================
# Brewfile — managed with `brew bundle --global` (this file is ~/.Brewfile)
# Regenerate a snapshot with:  brew bundle dump --global --describe --force
# =============================================================================

# -----------------------------------------------------------------------------
# Taps
# -----------------------------------------------------------------------------
tap "homebrew/bundle"
tap "homebrew/services"
tap "argoproj/tap"                  # Argo CD / Rollouts tools
tap "aws/tap"                       # AWS SAM CLI
tap "coverallsapp/coveralls"        # Coveralls uploader
tap "d12frosted/emacs-plus"         # emacs-plus builds
tap "dopplerhq/doppler"             # Doppler secrets CLI
tap "gromgit/fuse"                  # FUSE ports (encfs-mac)
tap "heroku/brew"                   # Heroku CLI
tap "johanhaleby/kubetail"          # kubetail
tap "localstack/tap"               # LocalStack CLI
tap "macos-fuse-t/cask"            # FUSE-T (kext-less FUSE)
tap "magalucloud/mgccli"            # Magalu Cloud CLI
tap "oven-sh/bun"                   # Bun JS runtime
tap "superfly/tap"                  # Fly.io flyctl

# -----------------------------------------------------------------------------
# Shell & terminal
# -----------------------------------------------------------------------------
brew "zsh"                          # UNIX shell (command interpreter)
brew "bash-completion"             # Programmable completion for Bash
brew "mix-completion"             # Elixir Mix completion + shortcuts/colors
brew "csshx"                        # Cluster ssh tool for Terminal.app

# -----------------------------------------------------------------------------
# Core CLI utilities & modern replacements
# -----------------------------------------------------------------------------
brew "coreutils"                    # GNU file, shell and text utilities
brew "gnu-sed"                      # GNU stream editor
brew "grep"                         # GNU grep, egrep and fgrep
brew "watch"                        # Run a program periodically, fullscreen
brew "rename"                       # Perl-powered batch file rename
brew "rsync"                        # Fast incremental file transfer
brew "htop"                         # Interactive process viewer (better top)
brew "eza"                          # Modern replacement for ls
brew "fzf"                          # Command-line fuzzy finder
brew "glow"                         # Render markdown on the CLI
brew "jq"                           # Command-line JSON processor
brew "p7zip"                        # 7-Zip file archiver
brew "csvkit"                       # CLI tools for working with CSV
brew "tabiew"                       # TUI to view/query CSV, TSV, Parquet, etc.
brew "python-tabulate"             # Pretty-print tabular data in Python

# -----------------------------------------------------------------------------
# Search
# -----------------------------------------------------------------------------
brew "the_silver_searcher"          # ag: code-search similar to ack

# -----------------------------------------------------------------------------
# Version control & dev workflow
# -----------------------------------------------------------------------------
brew "git"                          # Distributed revision control system
brew "gh"                           # GitHub command-line tool
brew "git-lfs"                      # Git extension for large files
brew "git-filter-repo"             # Quickly rewrite git repository history
brew "worktrunk"                    # Git worktree manager for parallel AI agents
brew "mercurial"                    # Scalable distributed version control
brew "subversion"                   # Apache Subversion (svn)
brew "direnv"                       # Per-directory environment variables
brew "act"                          # Run GitHub Actions locally
brew "forego"                       # Foreman in Go (Procfile process manager)
brew "earthly"                      # Build automation for the container era
brew "cookiecutter"                 # Create projects from templates

# -----------------------------------------------------------------------------
# Build tools
# -----------------------------------------------------------------------------
brew "make"                         # GNU make
brew "cmake"                        # Cross-platform make
brew "automake"                     # Generate GNU-compliant Makefiles
brew "ninja"                        # Small, fast build system
brew "bison"                        # Parser generator

# -----------------------------------------------------------------------------
# Languages & runtime managers
# -----------------------------------------------------------------------------
brew "mise"                         # Polyglot runtime manager (asdf clone)
brew "ruby-install"                 # Install Ruby/JRuby/TruffleRuby/etc.
brew "python@3.10"                  # Python 3.10 interpreter
brew "python@3.8"                   # Python 3.8 interpreter
brew "oven-sh/bun/bun"             # Fast JS runtime, bundler & package manager
brew "groovy"                       # Java-based scripting language
brew "leiningen"                    # Build tool for Clojure
brew "maven"                        # Java project management & build tool

# -----------------------------------------------------------------------------
# Cloud, infra & Kubernetes
# -----------------------------------------------------------------------------
brew "ansible"                      # Deployment & configuration automation
brew "awscli"                       # Official Amazon AWS CLI
brew "aws/tap/aws-sam-cli"         # Build/test/deploy AWS Serverless apps
brew "kubernetes-cli"              # kubectl: Kubernetes CLI
brew "argoproj/tap/kubectl-argo-rollouts"  # kubectl Argo Rollouts plugin
brew "helm"                         # Kubernetes package manager
brew "k9s"                          # Kubernetes TUI to manage clusters
brew "johanhaleby/kubetail/kubetail"       # Tail logs from multiple K8s pods
brew "heroku/brew/heroku"          # Heroku CLI
brew "superfly/tap/flyctl"          # Fly.io command-line tool
brew "netlify-cli"                  # Netlify command-line tool
brew "localstack/tap/localstack-cli"       # Run AWS cloud stack locally
brew "magalucloud/mgccli/mgccli"   # Magalu Cloud CLI
brew "dopplerhq/doppler/doppler", link: false  # Doppler secrets & config CLI
brew "cloudflared"                  # Cloudflare Tunnel client

# -----------------------------------------------------------------------------
# Databases
# -----------------------------------------------------------------------------
brew "postgresql@16"                # Object-relational database system
brew "pgcli"                        # Postgres CLI with autocompletion
brew "unixodbc"                     # ODBC 3 connectivity for UNIX

# -----------------------------------------------------------------------------
# Networking & HTTP
# -----------------------------------------------------------------------------
brew "httpie"                       # User-friendly cURL replacement
brew "wget"                         # Internet file retriever
brew "dog"                          # Command-line DNS client
brew "ipcalc"                       # Calculate network masks from an IP
brew "telnet"                       # User interface to the TELNET protocol
brew "wakeonlan"                    # Send magic packets to wake devices
brew "ssh-copy-id"                  # Install your key on a remote host
brew "sshpass"                      # Non-interactive SSH password auth
brew "tcpkali"                      # High-performance TCP/WebSocket load gen
brew "mitmproxy"                    # Intercept, modify & replay HTTP/S traffic
brew "syncthing"                    # Continuous file synchronization
brew "nut"                          # Network UPS Tools (power devices)

# -----------------------------------------------------------------------------
# Media — audio / video / images
# -----------------------------------------------------------------------------
brew "ffmpeg"                       # Record, convert and stream audio/video
brew "yt-dlp"                       # Feature-rich audio/video downloader
brew "youtube-dl"                   # Download videos from the command line
brew "subliminal"                   # Search and download subtitles
brew "mkvtoolnix"                   # Matroska (MKV) media manipulation tools
brew "imagemagick@6"                # Manipulate images in many formats
brew "graphicsmagick"               # Image processing tools collection

# -----------------------------------------------------------------------------
# Documents & publishing (PDF / markup / typesetting)
# -----------------------------------------------------------------------------
brew "pandoc"                       # Swiss-army knife of markup conversion
brew "hevea"                        # LaTeX-to-HTML translator
brew "opendetex"                    # Strip TeX/LaTeX commands from documents
brew "fop"                          # XSL-FO print formatter (PDF/PS)
brew "diff-pdf"                     # Visually compare two PDF files
brew "qpdf"                         # Transform and inspect PDF files
brew "mupdf-tools"                  # Lightweight PDF and XPS tools
brew "graphviz"                     # Graph visualization software
brew "docutils"                     # reStructuredText processing system
brew "pygments"                     # Generic syntax highlighter

# -----------------------------------------------------------------------------
# Security, secrets & reverse engineering
# -----------------------------------------------------------------------------
brew "pinentry-mac"                 # Pinentry for GPG on macOS
brew "pwgen"                         # Password generator
brew "qrencode"                     # QR Code generation
brew "crackpkcs"                    # Crack PKCS#12 files
brew "pdfcrack"                     # PDF password cracker
brew "apktool"                      # Reverse engineer Android APKs
brew "libphonenumber"               # Google phone number parsing library

# -----------------------------------------------------------------------------
# Misc utilities
# -----------------------------------------------------------------------------
brew "mas"                          # Mac App Store command-line interface
brew "f3"                           # Test flash cards for fake capacity
brew "wimlib"                       # Create/extract Windows Imaging (WIM) files
brew "rtk"                          # CLI proxy to minimize LLM token usage
brew "coverallsapp/coveralls/coveralls"    # Coverage uploader for Coveralls

# -----------------------------------------------------------------------------
# Editors
# -----------------------------------------------------------------------------
brew "d12frosted/emacs-plus/emacs-plus@27" # GNU Emacs (emacs-plus build)

# -----------------------------------------------------------------------------
# Encrypted FUSE filesystem (needs a FUSE cask below)
# -----------------------------------------------------------------------------
brew "gromgit/fuse/encfs-mac"      # EncFS encrypted pass-through filesystem

# =============================================================================
# Casks (GUI applications)
# =============================================================================

# --- Browsers ---
cask "google-chrome"                # Web browser
cask "vivaldi"                       # Customizable browser with built-in mail
cask "choosy"                        # Pick which browser opens each link

# --- Terminals & editors ---
cask "iterm2"                        # Terminal emulator
cask "ghostty"                        # GPU-accelerated, native-UI terminal
cask "warp"                          # Rust-based terminal
cask "visual-studio-code"            # Open-source code editor
cask "zed"                            # Multiplayer code editor
cask "macdown"                       # Open-source Markdown editor

# --- Dev / infra GUIs ---
cask "openlens"                      # Lens Kubernetes IDE (open build)
cask "utm"                            # Virtual machines (QEMU front end)
cask "android-ndk"                   # Android native dev toolset
cask "android-platform-tools"        # adb/fastboot and friends
cask "raspberry-pi-imager"           # Flash OS images to microSD
cask "session-manager-plugin"        # AWS CLI Session Manager plugin
cask "openwebstart"                  # Run Java Web Start apps
cask "zenmap"                        # Nmap security scanner GUI
cask "ngrok"                          # Secure tunnels to localhost
cask "xquartz"                        # X.Org X Window System for macOS
cask "wkhtmltopdf"                   # Render HTML into PDF

# --- Filesystems & sync ---
cask "macfuse"                       # FUSE file system integration
cask "fuse-t"                         # Kext-less FUSE implementation
cask "dropbox"                       # Dropbox cloud storage client
cask "onedrive"                      # OneDrive cloud storage client
cask "qsyncthingtray"                # Tray app for Syncthing

# --- Media ---
cask "vlc"                            # Multimedia player
cask "spotify"                       # Music streaming
cask "ocenaudio"                     # Audio editor
cask "simple-comic"                  # Comic viewer/reader
cask "calibre"                        # E-book management
cask "filebot"                       # Rename movies/TV/anime/music
cask "transmission"                  # BitTorrent client

# --- Productivity & menu-bar utilities ---
cask "itsycal"                        # Menu bar calendar
cask "jumpcut"                        # Clipboard history manager
cask "rectangle"                      # Move/resize windows with shortcuts (successor to the discontinued Spectacle)
cask "puremac"                        # App manager & system cleaner
cask "aerial"                         # Apple TV aerial screensaver

# --- Communication ---
cask "slack"                          # Team communication
cask "zoom"                            # Video meetings
cask "elk"                            # Mastodon web client

# --- Graphics ---
cask "inkscape"                      # Vector graphics editor

# --- Security & crypto ---
cask "1password-cli"                 # 1Password CLI
cask "gpg-suite"                     # GPG tools for mail and files
cask "electrum"                      # Bitcoin thin client

# --- Archiving ---
cask "rar"                            # RAR/unrar archiver

# --- Fonts ---
cask "font-fira-code"
cask "font-fira-mono-for-powerline"
cask "font-hack"
cask "font-ia-writer-duospace"
cask "font-ia-writer-mono"
cask "font-ia-writer-quattro"

# =============================================================================
# Mac App Store apps
# =============================================================================
mas "1Password for Safari", id: 1569813296
mas "Goodnotes", id: 1444383602              # handwritten notes
mas "Todoist", id: 585829637                 # task manager
mas "Trello", id: 1278508951                 # kanban boards
mas "Telegram", id: 747648890                # messaging
mas "Tailscale", id: 1475387142              # WireGuard-based VPN
mas "NordVPN", id: 905953485                 # VPN
